Documents/ПередачаМатериаловПодрядчику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПередачаМатериаловПодрядчику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОбещаниеПодрядчика</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТоваровНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подрядчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницыИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПередачаМатериаловПодрядчику/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
		              |	ОстаткиТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
		              |	ОстаткиТоваровНаСкладахОстатки.Склад КАК Склад,
		              |	ОстаткиТоваровНаСкладахОстатки.КоличествоОстаток КАК Количество,
		              |	ОстаткиТоваровНаСкладахОстатки.СуммаСНДСОстаток КАК СуммаСНДС
		              |ИЗ
		              |	РегистрНакопления.ОстаткиТоваровНаСкладах.Остатки(&Дата, Номенклатура В (&МассивМатериалы)) КАК ОстаткиТоваровНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(ЭтотОбъект.МоментВремени(), ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("Склад", ЭтотОбъект.Склад);
	Запрос.УстановитьПараметр("МассивМатериалы", Материалы.ВыгрузитьКолонку("Номенклатура"));
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	стОтбор = Новый Структура("Номенклатура", );
	
	Движения.ОстаткиТоваровНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаМатериалы Из Материалы Цикл 
		
		стОтбор.Номенклатура = ТекСтрокаМатериалы.Номенклатура;
		НайденныеСтроки = ТЗ.НайтиСтроки(стОтбор);
		
		Количество = ТекСтрокаМатериалы.Количество * ТекСтрокаМатериалы.Коэффициент; 
		

		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
		    Если НайденнаяСтрока.Количество = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Движение = Движения.ОстаткиТоваровНаСкладах.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Номенклатура 		= ТекСтрокаМатериалы.Номенклатура;
			Движение.Период 			= Дата;
			Движение.Склад 				= Склад;
			
			Если НайденнаяСтрока.Количество >= Количество Тогда
				Движение.СуммаСНДС 	= Окр((НайденнаяСтрока.СуммаСНДС / НайденнаяСтрока.Количество) * Количество, 2);
				Движение.Количество = Количество;
				
				НайденнаяСтрока.СуммаСНДС  = НайденнаяСтрока.СуммаСНДС  - Движение.СуммаСНДС;
				НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - Количество;
				Количество = 0;
				Прервать;
			Иначе
				Движение.СуммаСНДС 	= НайденнаяСтрока.СуммаСНДС;
				Движение.Количество = НайденнаяСтрока.Количество;
				
				Количество 			= Количество - НайденнаяСтрока.Количество;
				
				НайденнаяСтрока.Количество = 0;
				НайденнаяСтрока.СуммаСНДС  = 0;
			КонецЕсли;
			
		КонецЦикла; 
		
		Если Количество > 0 Тогда
			Движение = Движения.ОстаткиТоваровНаСкладах.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Номенклатура 		= ТекСтрокаМатериалы.Номенклатура;
			Движение.Период 			= Дата;
			Движение.Склад 				= Склад;
			Движение.Количество			= Количество;
			Движение.СуммаСНДС			= 0;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Записать(); 
КонецПроцедуры
